espressif/arduino-esp32/tools/ide-debug/svd/esp32h2.svd
        <register>
          <name>RD_KEY1_DATA3</name>
          <description>Register $n of BLOCK5 (KEY1).</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA3</name>
              <description>Stores the third 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA4</name>
          <description>Register $n of BLOCK5 (KEY1).</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA4</name>
              <description>Stores the fourth 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA5</name>
          <description>Register $n of BLOCK5 (KEY1).</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA5</name>
              <description>Stores the fifth 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA6</name>
          <description>Register $n of BLOCK5 (KEY1).</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA6</name>
              <description>Stores the sixth 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA7</name>
          <description>Register $n of BLOCK5 (KEY1).</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA7</name>
              <description>Stores the seventh 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA0</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA1</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA1</name>
              <description>Stores the first 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA2</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA2</name>
              <description>Stores the second 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA3</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA3</name>
              <description>Stores the third 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA4</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA4</name>
              <description>Stores the fourth 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA5</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA5</name>
              <description>Stores the fifth 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA6</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA6</name>
              <description>Stores the sixth 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY2_DATA7</name>
          <description>Register $n of BLOCK6 (KEY2).</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY2_DATA7</name>
              <description>Stores the seventh 32 bits of KEY2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA0</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA1</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA1</name>
              <description>Stores the first 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA2</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA2</name>
              <description>Stores the second 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA3</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA3</name>
              <description>Stores the third 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA4</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA4</name>
              <description>Stores the fourth 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA5</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA5</name>
              <description>Stores the fifth 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA6</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA6</name>
              <description>Stores the sixth 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY3_DATA7</name>
          <description>Register $n of BLOCK7 (KEY3).</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY3_DATA7</name>
              <description>Stores the seventh 32 bits of KEY3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA0</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA1</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA1</name>
              <description>Stores the first 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA2</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA2</name>
              <description>Stores the second 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA3</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA3</name>
              <description>Stores the third 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA4</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA4</name>
              <description>Stores the fourth 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA5</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA5</name>
              <description>Stores the fifth 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA6</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA6</name>
              <description>Stores the sixth 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY4_DATA7</name>
          <description>Register $n of BLOCK8 (KEY4).</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY4_DATA7</name>
              <description>Stores the seventh 32 bits of KEY4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA0</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA1</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA1</name>
              <description>Stores the first 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA2</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA2</name>
              <description>Stores the second 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA3</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA3</name>
              <description>Stores the third 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA4</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA4</name>
              <description>Stores the fourth 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA5</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA5</name>
              <description>Stores the fifth 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA6</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA6</name>
              <description>Stores the sixth 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY5_DATA7</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY5_DATA7</name>
              <description>Stores the seventh 32 bits of KEY5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA0</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_0</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA1</name>
          <description>Register $n of BLOCK9 (KEY5).</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_1</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA2</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_2</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA3</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_3</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA4</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_4</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA5</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_5</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART2_DATA6</name>
          <description>Register $n of BLOCK10 (system).</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_6</name>
              <description>Stores the 0th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
