espressif/arduino-esp32/tools/ide-debug/svd/esp32h2.svd
        <register>
          <name>EVT_TASK_EN2</name>
          <description>Ledc event task enable bit register2.</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASK_GAMMA_RESTART_CH0_EN</name>
              <description>Ledc ch0 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH1_EN</name>
              <description>Ledc ch1 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH2_EN</name>
              <description>Ledc ch2 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH3_EN</name>
              <description>Ledc ch3 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH4_EN</name>
              <description>Ledc ch4 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH5_EN</name>
              <description>Ledc ch5 gamma restart task enable register, write 1 to enable this task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH0_EN</name>
              <description>Ledc ch0 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH1_EN</name>
              <description>Ledc ch1 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH2_EN</name>
              <description>Ledc ch2 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH3_EN</name>
              <description>Ledc ch3 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH4_EN</name>
              <description>Ledc ch4 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH5_EN</name>
              <description>Ledc ch5 gamma pause task enable register, write 1 to enable this task.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH0_EN</name>
              <description>Ledc ch0 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH1_EN</name>
              <description>Ledc ch1 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH2_EN</name>
              <description>Ledc ch2 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH3_EN</name>
              <description>Ledc ch3 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH4_EN</name>
              <description>Ledc ch4 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH5_EN</name>
              <description>Ledc ch5 gamma resume task enable register, write 1 to enable this task.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CMP</name>
          <description>Ledc timer%s compare value register.</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_CMP</name>
              <description>This register stores ledc timer%s compare value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CNT_CAP</name>
          <description>Ledc timer%s count value capture register.</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_CNT_CAP</name>
              <description>This register stores ledc timer%s count value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>Global ledc configuration register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_CLK_SEL</name>
              <description>This bit is used to select clock source for the 4 timers .

2'd1: APB_CLK 2'd2: RTC8M_CLK 2'd3: XTAL_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH0</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH1</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH2</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH3</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH4</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH5</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application writes or read gamma ram.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>This bit is used to control clock.

1'b1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02111150</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>This is the version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
