espressif/arduino-esp32/tools/ide-debug/svd/esp32h2.svd
        <register>
          <name>OUT_EP2_ST</name>
          <description>JTAG OUT endpoint status information.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_STATE</name>
              <description>State of OUT Endpoint 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_WR_ADDR</name>
              <description>Write data address of OUT endpoint 2. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is detected, there are USB_DEVICE_OUT_EP2_WR_ADDR-2 bytes data in OUT EP2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_RD_ADDR</name>
              <description>Read data address of OUT endpoint 2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>Clock enable control</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CONF</name>
          <description>Memory power control</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_USB_MEM_PD</name>
              <description>1: power down usb memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_MEM_CLK_EN</name>
              <description>1: Force clock on for usb memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_RST</name>
          <description>CDC-ACM chip reset control.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_RTS</name>
              <description>1: Chip reset is detected from usb serial channel. Software write 1 to clear it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DTR</name>
              <description>1: Chip reset is detected from usb jtag channel. Software write 1 to clear it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_UART_CHIP_RST_DIS</name>
              <description>Set this bit to disable chip reset from usb serial channel to reset chip.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_LINE_CODE_W0</name>
          <description>W0 of SET_LINE_CODING command.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_DW_DTE_RATE</name>
              <description>The value of dwDTERate set by host through SET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_LINE_CODE_W1</name>
          <description>W1 of SET_LINE_CODING command.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_BCHAR_FORMAT</name>
              <description>The value of bCharFormat set by host through SET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_BPARITY_TYPE</name>
              <description>The value of bParityTpye set by host through SET_LINE_CODING command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_BDATA_BITS</name>
              <description>The value of bDataBits set by host through SET_LINE_CODING command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GET_LINE_CODE_W0</name>
          <description>W0 of GET_LINE_CODING command.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_GET_DW_DTE_RATE</name>
              <description>The value of dwDTERate set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GET_LINE_CODE_W1</name>
          <description>W1 of GET_LINE_CODING command.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_GET_BDATA_BITS</name>
              <description>The value of bCharFormat set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_BPARITY_TYPE</name>
              <description>The value of bParityTpye set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_BCHAR_FORMAT</name>
              <description>The value of bDataBits set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_UPDATE</name>
          <description>Configuration registers' value update</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_CONFIG_UPDATE</name>
              <description>Write 1 to this register would update the value of configure registers from APB clock domain to 48MHz clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER_AFIFO_CONFIG</name>
          <description>Serial AFIFO configure register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_AFIFO_RESET_WR</name>
              <description>Write 1 to reset CDC_ACM IN async FIFO write clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_AFIFO_RESET_RD</name>
              <description>Write 1 to reset CDC_ACM IN async FIFO read clock domain.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_AFIFO_RESET_WR</name>
              <description>Write 1 to reset CDC_ACM OUT async FIFO write clock domain.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_AFIFO_RESET_RD</name>
              <description>Write 1 to reset CDC_ACM OUT async FIFO read clock domain.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_AFIFO_REMPTY</name>
              <description>CDC_ACM OUTOUT async FIFO empty signal in read clock domain.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_AFIFO_WFULL</name>
              <description>CDC_ACM OUT IN async FIFO empty signal in write clock domain.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_RESET_ST</name>
          <description>USB Bus reset status register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_USB_BUS_RESET_ST</name>
              <description>USB bus reset status. 0: USB-Serial-JTAG is in usb bus reset status. 1: USB bus reset is released.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x02109220</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>